PANDAS DATE TIME FUNCTIONS

In [1]:
import pandas as pd
df=pd.read_csv('hrdata.csv')
df

     name  hiredate   salary  sickdays remaining
0   radha  03/15/21  50000.0                  10
1    pari  14/12/21  60000.0                   8
2   neeta  12/12/21  50000.0                  10
3  kavita  16/12/21  80000.0                   3
4    sonu  19/12/21  90000.0                   7
5    john  12/02/21  50000.0                   6

In [3]:
d=pd.to_datetime({'year':[2015],'month':[2],'day':[4]})
d

0   2015-02-04
dtype: datetime64[ns]

In [2]:
df['hiredate']=pd.to_datetime(df['hiredate'])
df

     name   hiredate   salary  sickdays remaining
0   radha 2021-03-15  50000.0                  10
1    pari 2021-12-14  60000.0                   8
2   neeta 2021-12-12  50000.0                  10
3  kavita 2021-12-16  80000.0                   3
4    sonu 2021-12-19  90000.0                   7
5    john 2021-12-02  50000.0                   6

In [5]:
daterange=pd.date_range(start='1/1/2020',end='1/10/2020',freq='D')
daterange

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10'],
              dtype='datetime64[ns]', freq='D')

In [6]:
daterange=pd.date_range(start='1/1/2020',end='5/1/2020',freq='M')

In [7]:
daterange

DatetimeIndex(['2020-01-31', '2020-02-29', '2020-03-31', '2020-04-30'], dtype='datetime64[ns]', freq='M')

In [8]:
import datetime
dt=datetime.datetime.now()
print(dt)

2022-02-19 18:36:30.278342

In [9]:
print(dt+pd.to_timedelta(10, unit='D'))

2022-03-01 18:36:30.278342

In [11]:
df['day']=df['hiredate'].dt.day
df['month']=df['hiredate'].dt.month
df['year']=df['hiredate'].dt.year
print(df)

     name   hiredate   salary  sickdays remaining  day  month  year
0   radha 2021-03-15  50000.0                  10   15      3  2021
1    pari 2021-12-14  60000.0                   8   14     12  2021
2   neeta 2021-12-12  50000.0                  10   12     12  2021
3  kavita 2021-12-16  80000.0                   3   16     12  2021
4    sonu 2021-12-19  90000.0                   7   19     12  2021
5    john 2021-12-02  50000.0                   6    2     12  2021